Autodesk.Revit.DB.FailureHandlingOptions.SetFailuresPreprocessor(Autodesk.Revit.DB.IFailuresPreprocessor)
Sets the callback to be invoked in the beginning of failure processing.
preprocessor:
The callback to be invoked in the beginning of failure processing.
Returns:
This FailureHandlingOptions object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.SetTransactionFinalizer(Autodesk.Revit.DB.ITransactionFinalizer)
Sets the callback to be executed after the transaction is completed.
finalizer:
The callback to be executed after the transaction is completed.
Returns:
This FailureHandlingOptions object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011